---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.ExternalResourceReferenceFailures
source: html/c84e59be-988e-dfb2-e2c5-2420e7feca69.htm
---
# BuiltInFailures.ExternalResourceReferenceFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.